Tekla Open API Reference for Tekla Structures 2025
BoltGroup.ThreadInMaterial Property
 Whether the thread goes inside the materal or not.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltGroup.BoltThreadInMaterialEnum ThreadInMaterial { get; set; }
Public Property ThreadInMaterial As BoltGroup.BoltThreadInMaterialEnum
	Get
	Set
Property Value
Type: BoltGroup.BoltThreadInMaterialEnum
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace